<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of XtoCC, also known as X27.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.macvfx.download.X27</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>X27</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://intelligentassistance.com/appcast/projectXto7.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>CodeSignatureVerifier</string>
		  <key>Arguments</key>
		  <dict>
			<key>input_path</key>
			<string>%RECIPE_CACHE_DIR%/downloads/Applications/Project X₂7.app</string>
			<key>requirement</key>
			<string>identifier "com.AssistedEditing.ProjectXto7" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = BEZQTYWJB6</string>
		  </dict>
		</dict>
		</array>
</dict>
</plist>
